/*******************************************************************************
* Дан радиус-вектор на плоскости с координатами конца и начала
{a,b} Найдите длину этого вектора.
Ответ должен совпадать с точностью до двух знаков после запятой
 ******************************************************************************/
#include <iostream>
#include <cmath>
#include <iomanip>
int main() {
    double a, b;
    std::cin >> a >> b;
    std::cout << std::fixed << std::setprecision(2) << sqrt(a * a + b * b) << '\n';
    return 0;
}
