/*******************************************************************************
 * Даны два вещественных числа - длины катетов
 * прямоугольного треугольника.
 * Найти и вывести квадрат длины гипотенузы
 * с точностью два знака после запятой.
 ******************************************************************************/
#include <iostream>
#include <cmath>
#include <iomanip>
int main() {
    double a, b;
    std::cin >> a >> b;
    std::cout << std::fixed << std::setprecision(2) << a * a + b * b << '\n';
    return 0;
}
