/*******************************************************************************
 * Даны три вещественных числа - длины сторон треугольника.
 * Найти и вывести квадрат его площади
 * с точностью два знака после запятой.
 ******************************************************************************/
#include <iomanip>
#include <iostream>
int main() {
    double a, b, c;
    std::cin >> a >> b >> c;
    double p = (a + b + c) / 2;
    std::cout << std::fixed <<
        std::setprecision(2) <<p * (p - a) * (p - b) * (p - c) << '\n';
    return 0;
}
